Revit 2027 API
ParameterTypeId.StairsSupportTrimSupportUpper Property
 "Trim Support at Upper": Trim Support at Upper
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupportTrimSupportUpper { get; }
Public Shared ReadOnly Property StairsSupportTrimSupportUpper As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupportTrimSupportUpper {
	ForgeTypeId^ get ();
}
static member StairsSupportTrimSupportUpper : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace